HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/application_code/main.c
    prvMiscInitialization();
    UserInitialization();
    prvDisplayInitialize();
    prvDisplayWrite("FreeRTOS init\r\n");

#if (ENABLE_CREDENTIAL_BY_CLI == 1)
    /* Register the standard CLI commands. */
    vRegisterSampleCLICommands();
    vUARTCommandConsoleStart(mainUART_COMMAND_CONSOLE_STACK_SIZE, mainUART_COMMAND_CONSOLE_TASK_PRIORITY);
#endif

    xResults = littlFs_init();
    prvDisplayWrite((LFS_ERR_OK == xResults) ? "LittleFS OK\r\n" : "LittleFS ERROR\r\n");

    xMQTTAgentInit();
    prvDisplayWrite("MQTT agent init\r\n");

    if (LFS_ERR_OK == xResults)
    {
        xCacheInitResult = vprvCacheInit();
    }

#if (ENABLE_CREDENTIAL_BY_CLI == 1)
    if( ( LFS_ERR_OK == xResults ) &&
        ( LFS_ERR_OK == xCacheInitResult ) &&
        ( pdTRUE == prvShouldAutoProvisionFromClientCredentials() ) )
    {
        vAssignCredentials();
    }
#endif

#if (ENABLE_CREDENTIAL_BY_CLI == 0)
    vAssignCredentials();
#else
    xProceedToDemo = ApplicationCounter(Time2Wait);
#endif

    if (pdTRUE == xProceedToDemo)
    {
    #if (ENABLE_CREDENTIAL_BY_CLI == 1)
        /* Remove CLI task before going to demo. */
        /* CLI and Log tasks use common resources but are not exclusively controlled. */
        /* For this reason, the CLI task must be deleted before executing the Demo. */
        if( xCLIHandle != NULL )
        {
            vTaskDelete(xCLIHandle);
        }
    #endif

        /* Initialise the RTOS's TCP/IP stack.  The tasks that use the network
            are created in the vApplicationIPNetworkEventHook() hook function
            below.  The hook function is called when the network connects. */
        prvDisplayWrite("Network init\r\n");

        FreeRTOS_IPInit(ucIPAddress,
                        ucNetMask,
                        ucGatewayAddress,
                        ucDNSServerAddress,
                        ucMACAddress );

        /* We should wait for the network to be up before we run any demos. */
        while (FreeRTOS_IsNetworkUp() == pdFALSE)
        {
            vTaskDelay(300);
        }

        FreeRTOS_printf(("Initialise the RTOS's TCP/IP stack\n"));
        prvDisplayWrite("Network up\r\n");

        FreeRTOS_printf(("---------STARTING DEMO---------\r\n"));
        prvDisplayWrite("Starting demo\r\n");

            #if (ENABLE_FLEET_PROVISIONING_DEMO == 1)
                vStartFleetProvisioningDemo();
            #else
                xSetMQTTAgentState(MQTT_AGENT_STATE_INITIALIZED);
            #endif

            vStartMQTTAgent (appmainMQTT_AGENT_TASK_STACK_SIZE, appmainMQTT_AGENT_TASK_PRIORITY);
            prvDisplayWrite("MQTT task start\r\n");

            vStartSimplePubSubDemo ();
            prvDisplayWrite("PubSub task start\r\n");

            #if (ENABLE_OTA_UPDATE_DEMO == 1)
                        vStartOtaDemo();
                        prvDisplayWrite("OTA task start\r\n");
            #endif
    }
    else
    {
        prvDisplayWrite("CLI mode active\r\n");
    }

    while (1)
    {
        vTaskSuspend(NULL);
    }
}
/*****************************************************************************************
End of function main_task
****************************************************************************************/
/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: prvMiscInitialization
 * Description  : .
 * Return Value : .
 *********************************************************************************************************************/
void prvMiscInitialization(void)
{
    /* Initialize UART for serial terminal. */
    CLI_Support_Settings();

    xStartDemoEventGroup = xEventGroupCreate();

    /* Start logging task. */
    xLoggingTaskInitialize(mainLOGGING_TASK_STACK_SIZE,
                            tskIDLE_PRIORITY + 2,
                            mainLOGGING_MESSAGE_QUEUE_LENGTH);

}
/*****************************************************************************************
End of function prvMiscInitialization
****************************************************************************************/
/*-----------------------------------------------------------*/

static void prvDisplayInitialize( void )
{
    if( pdFALSE == xDisplayInitialized )
    {
        R_SIMPLE_GLCDC_CONFIG_Open();
        R_SIMPLE_GRAPHIC_Open();
        xDisplayInitialized = pdTRUE;
        prvDisplayWriteBanner();
    }
}
/*-----------------------------------------------------------*/

static void prvDisplayWriteBanner( void )
{
    char cVersionLine[96];

    prvDisplayWrite("\r\n");
    prvDisplayWrite("RX72N Envision Kit\r\n");
    prvDisplayWrite("AWS FreeRTOS IoT Reference\r\n");
    prvDisplayWrite("Implementation Demo\r\n");
    prvDisplayWrite("----------------------------------------\r\n");

    (void) sprintf(cVersionLine,
                   "Firmware: %u.%u.%u\r\n",
                   (unsigned int) APP_VERSION_MAJOR,
                   (unsigned int) APP_VERSION_MINOR,
                   (unsigned int) APP_VERSION_BUILD);
    prvDisplayWrite(cVersionLine);

    prvDisplayWrite("OS: " democonfigOS_NAME " " democonfigOS_VERSION "\r\n");
    prvDisplayWrite("MQTT: " democonfigMQTT_LIB "\r\n");

    (void) sprintf(cVersionLine,
                   "BSP: %u.%u\r\n",
                   (unsigned int) R_BSP_VERSION_MAJOR,
                   (unsigned int) R_BSP_VERSION_MINOR);
    prvDisplayWrite(cVersionLine);

    prvDisplayWrite("Built: " __DATE__ " " __TIME__ "\r\n");
    prvDisplayWrite("----------------------------------------\r\n");
}
/*-----------------------------------------------------------*/

static void prvDisplayWrite( const char * pcMessage )
{
    if( ( pdFALSE != xDisplayInitialized ) && ( NULL != pcMessage ) )
    {
        vApplicationLcdLogString(pcMessage, (unsigned short) strlen(pcMessage));
    }
}
/*-----------------------------------------------------------*/

void vApplicationLcdLogString( const char * pcMessage, unsigned short usStringLength )
{
    unsigned short usIndex;

