HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/application_code/main.c
#endif /* iotconfigUSE_PORT_SPECIFIC_HOOKS */
/*-----------------------------------------------------------*/

#if ( ipconfigUSE_LLMNR != 0 ) || ( ipconfigUSE_NBNS != 0 ) || ( ipconfigDHCP_REGISTER_HOSTNAME == 1 )

/**********************************************************************************************************************
 * Function Name: pcApplicationHostnameHook
 * Description  : This function will be called during the DHCP: the machine will be registered
 *                 with an IP address plus this name.
 *                 Note: Please make sure vprvCacheInit() is called before this function, because
 *                 it retrieves thingname value from KeyValue table.
 * Return Value : .
 *********************************************************************************************************************/
const char * pcApplicationHostnameHook(void)
    {
#if defined(__TEST__)
        return clientcredentialIOT_THING_NAME;
#else
    {
        /* The string returned by this API is stipulated to be a maximum of 32 characters. */
        static char s_buff[32];
        memset (s_buff, 0x00, sizeof(s_buff));

        size_t valueLength = prvGetCacheEntryLength(KVS_CORE_THING_NAME);

        /* Process for thing name input by CLI. */
        if (valueLength > 0)
        {
            if (valueLength > 31)
            {
                configPRINT_STRING(("Warning: thing name with null-terminate string is longer than 32 characters.\r\n"));
                valueLength = 31;
            }
            size_t xLength = xReadEntry(KVS_CORE_THING_NAME, s_buff, valueLength);
            if (0 != xLength)
            {
                s_buff[valueLength] = '\0';
                return s_buff;
            }
            else
            {
                valueLength = strlen(clientcredentialIOT_THING_NAME);
                if (valueLength > 31)
                {
                    configPRINT_STRING(("Warning: thing name with null-terminate string is longer than 32 characters.\r\n"));
                    valueLength = 31;
                }
                strncpy(s_buff, clientcredentialIOT_THING_NAME, valueLength);
                s_buff[valueLength] = '\0';
                return s_buff;
            }
        }
        /* Process for thing name in aws_clientcredential.h. */
        else
        {
            valueLength = strlen(clientcredentialIOT_THING_NAME);
            if (valueLength > 31)
            {
                configPRINT_STRING(("Warning: thing name with null-terminate string is longer than 32 characters.\r\n"));
                valueLength = 31;
            }
            strncpy(s_buff, clientcredentialIOT_THING_NAME, valueLength);
            s_buff[valueLength] = '\0';
            return s_buff;
        }
    }
#endif
    }
#endif
/*****************************************************************************************
 End of function pcApplicationHostnameHook
 ****************************************************************************************/

/**********************************************************************************************************************
 * Function Name: ApplicationCounter
 * Description  : .
 * Argument     : xWaitTime
 * Return Value : .
 *********************************************************************************************************************/
bool ApplicationCounter(uint32_t xWaitTime)
{
    TickType_t xCurrent;
    bool DEMO_TEST = pdTRUE;
    const TickType_t xPrintFrequency = pdMS_TO_TICKS(xWaitTime);
    xCurrent = xTaskGetTickCount();
    signed char cRxChar;
    while (xCurrent < xPrintFrequency)
    {
        vTaskDelay(1);
        xCurrent = xTaskGetTickCount();

        cRxChar = vISR_Routine();
        if ((0 != cRxChar))
        {

            DEMO_TEST = pdFALSE;
            break;
        }
    }
    return DEMO_TEST;
}
/*****************************************************************************************
 End of function ApplicationCounter
 ****************************************************************************************/

/**********************************************************************************************************************
 * Function Name: vISR_Routine
 * Description  : .
 * Return Value : .
 *********************************************************************************************************************/
signed char vISR_Routine(void)
{
    BaseType_t xTaskWokenByReceive = pdFALSE;
    extern signed char cRxedChar;
    return cRxedChar;
}
/*****************************************************************************************
 End of function vISR_Routine
 ****************************************************************************************/

static BaseType_t prvShouldAutoProvisionFromClientCredentials( void )
{
    if( clientcredentialMQTT_BROKER_ENDPOINT[ 0 ] == '\0' )
    {
        return pdFALSE;
    }

    if( strcmp( clientcredentialIOT_THING_NAME, "dummy" ) == 0 )
    {
        return pdFALSE;
    }

    if( ( keyCLIENT_CERTIFICATE_PEM == NULL ) || ( keyCLIENT_PRIVATE_KEY_PEM == NULL ) )
    {
        return pdFALSE;
    }

    if( ( prvGetCacheEntryLength( KVS_CORE_THING_NAME ) > 0U ) &&
        ( prvGetCacheEntryLength( KVS_CORE_MQTT_ENDPOINT ) > 0U ) )
    {
        return pdFALSE;
    }

    return pdTRUE;
}
/**********************************************************************************************************************
 * Function Name: vAssignCredentials
 * Description  : Handle pre-provisioning.
 * Return Value : .
 *********************************************************************************************************************/
BaseType_t vAssignCredentials(void)
{
    BaseType_t xCommitResult;
    int32_t xStoreResult;

    /* Write thing name */
    char *pValue = democonfigCLIENT_IDENTIFIER;
    xStoreResult = xprvWriteCacheEntry(strlen("thingname"), "thingname", strlen(pValue), pValue);
    if( xStoreResult < 0 )
    {
        return pdFALSE;
    }

    /* Write endpoint */
    pValue = democonfigMQTT_BROKER_ENDPOINT;
    xStoreResult = xprvWriteCacheEntry(strlen("endpoint"), "endpoint", strlen(pValue), pValue);
    if( xStoreResult < 0 )
    {
        return pdFALSE;
    }

    /* Write certificate */
    pValue = keyCLIENT_CERTIFICATE_PEM;
    xStoreResult = xprvWriteCacheEntry(strlen("cert"), "cert", strlen(pValue), pValue);
    if( xStoreResult < 0 )
    {
        return pdFALSE;
    }

    /* Write private key */
    pValue = keyCLIENT_PRIVATE_KEY_PEM;
    xStoreResult = xprvWriteCacheEntry(strlen("key"), "key", strlen(pValue), pValue);
    if( xStoreResult < 0 )
    {
        return pdFALSE;
    }

    /* Write code signing certificate */
    pValue = otapalconfigCODE_SIGNING_CERTIFICATE;
    xStoreResult = xprvWriteCacheEntry(strlen("codesigncert"), "codesigncert", strlen(pValue), pValue);
    if( xStoreResult < 0 )
    {
        return pdFALSE;
    }

    /* Write root CA */
    pValue = democonfigROOT_CA_PEM;
    xStoreResult = xprvWriteCacheEntry(strlen("rootca"), "rootca", strlen(pValue), pValue);
    if( xStoreResult < 0 )
    {
        return pdFALSE;
    }

    /* Write cache to DF */
    xCommitResult = KVStore_xCommitChanges();

    return xCommitResult;
}
/**********************************************************************************************************************
 End of function vAssignCredentials
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * Function Name: OtaSelfTest
 * Description  : The test function executed during the self-check process during an OTA update
 * Return Value : pdTRUE (if the self-test was successful)
 *                pdFALSE (if the self-test was failed)
 *                Always return pdTRUE since the initial firmware was evaluated during the manufacturing process.
 *********************************************************************************************************************/
BaseType_t OtaSelfTest(void)
{
	return pdTRUE;
}
